# Chapter 4 – Pandas and Data Cleaning

Main reference:<br>
- Chapter 5, 7, Python for Data Analysis, by Wes McKinney
- Data Analysis with Python, by IBM

Last edited: 05/16/2021

-----

**Contents of this Notebook:**

- [Section 1. Introduction to pandas Data Structures](#Section-1.-Introduction-to-pandas-Data-Structures)
- [Section 2. Data Cleaning](#Section-2.-Data-Cleaning) (05/11/2021 updated)

# Section 1. Introduction to pandas Data Structures

`pandas.DataFrame()`: A rectangular table of data and contains an ordered collection of columns. <br>
*(Similar with data frame in R, table in MATLAB, one worksheet in Excel, or general data in Stata.)*

`pandas.Series()`: One-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

In [1]:
# %load_ext nb_black
import numpy as np
import pandas as pd

## Create a Pandas DataFrame

There are many ways to construct a DataFrame, though one of the most common is from a dict of **equal-length** lists or NumPy arrays

In [2]:
data = {
    "state": ["Indiana", "Indiana", "Indiana", "Ohio", "Ohio", "Ohio"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [6.0, 6.1, 6.2, 11.2, 11.4, 11.5],
}

frame = pd.DataFrame(data)

In [3]:
frame

     state  year   pop
0  Indiana  2000   6.0
1  Indiana  2001   6.1
2  Indiana  2002   6.2
3     Ohio  2001  11.2
4     Ohio  2002  11.4
5     Ohio  2003  11.5

In [4]:
frame.head()

     state  year   pop
0  Indiana  2000   6.0
1  Indiana  2001   6.1
2  Indiana  2002   6.2
3     Ohio  2001  11.2
4     Ohio  2002  11.4

In [5]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

Sort the column order

In [6]:
columnlist = ["year", "pop", "state"]

In [7]:
frame[columnlist]

   year   pop    state
0  2000   6.0  Indiana
1  2001   6.1  Indiana
2  2002   6.2  Indiana
3  2001  11.2     Ohio
4  2002  11.4     Ohio
5  2003  11.5     Ohio

Show columns data type

In [8]:
frame.dtypes

state     object
year       int64
pop      float64
dtype: object

If you try to convert few lists or narrays into a dataframe directly, you might get something different. See the following example:

In [9]:
state = ["Indiana", "Indiana", "Indiana", "Ohio", "Ohio", "Ohio"]
year = np.array([2000, 2001, 2002, 2001, 2002, 2003])
pop = [6.0, 6.1, 6.2, 11.2, 11.4, 11.5]

frame2 = pd.DataFrame([state, year, pop])
frame2

         0        1        2     3     4     5
0  Indiana  Indiana  Indiana  Ohio  Ohio  Ohio
1     2000     2001     2002  2001  2002  2003
2        6      6.1      6.2  11.2  11.4  11.5

In [10]:
list(zip(state, year, pop))

[('Indiana', 2000, 6.0),
 ('Indiana', 2001, 6.1),
 ('Indiana', 2002, 6.2),
 ('Ohio', 2001, 11.2),
 ('Ohio', 2002, 11.4),
 ('Ohio', 2003, 11.5)]

In [11]:
# Generate the correct data frame

state = ["Indiana", "Indiana", "Indiana", "Ohio", "Ohio", "Ohio"]
year = np.array([2000, 2001, 2002, 2001, 2002, 2003])
pop = [6.0, 6.1, 6.2, 11.2, 11.4, 11.5]

frame2 = pd.DataFrame(zip(state, year, pop), columns=["state", "year", "pop"])
frame2

     state  year   pop
0  Indiana  2000   6.0
1  Indiana  2001   6.1
2  Indiana  2002   6.2
3     Ohio  2001  11.2
4     Ohio  2002  11.4
5     Ohio  2003  11.5

In [12]:
# check if both methods work
frame == frame2

   state  year   pop
0   True  True  True
1   True  True  True
2   True  True  True
3   True  True  True
4   True  True  True
5   True  True  True

In [13]:
frame.equals(frame2)

True

### A column in a DataFrame can be retrieved as a `Series` either by 
- by **dict-like notation**, i.e. 
        frame['state']
or 
- by **attribute**
        frame.state

In [14]:
frame["state"]

0    Indiana
1    Indiana
2    Indiana
3       Ohio
4       Ohio
5       Ohio
Name: state, dtype: object

In [15]:
frame.state

0    Indiana
1    Indiana
2    Indiana
3       Ohio
4       Ohio
5       Ohio
Name: state, dtype: object

## Index

Each row has an associated array of data labels, called index. The default integer index beginning at 0. We can set it when constructing the data frame.

In [16]:
frame3 = pd.DataFrame(
    data, columns=["state", "year", "pop", "area"], index=["a", "b", "c", "d", "e", "f"]
)

frame3

     state  year   pop area
a  Indiana  2000   6.0  NaN
b  Indiana  2001   6.1  NaN
c  Indiana  2002   6.2  NaN
d     Ohio  2001  11.2  NaN
e     Ohio  2002  11.4  NaN
f     Ohio  2003  11.5  NaN

In [17]:
frame3.loc["a", "area"] is np.nan

True

In [18]:
frame3.reset_index()

  index    state  year   pop area
0     a  Indiana  2000   6.0  NaN
1     b  Indiana  2001   6.1  NaN
2     c  Indiana  2002   6.2  NaN
3     d     Ohio  2001  11.2  NaN
4     e     Ohio  2002  11.4  NaN
5     f     Ohio  2003  11.5  NaN

In [19]:
frame3.reset_index(drop=True)

     state  year   pop area
0  Indiana  2000   6.0  NaN
1  Indiana  2001   6.1  NaN
2  Indiana  2002   6.2  NaN
3     Ohio  2001  11.2  NaN
4     Ohio  2002  11.4  NaN
5     Ohio  2003  11.5  NaN

Note that we pass a column that isn’t contained in the dict, it will appear with missing values. We can check if the value is null by using `isnull()` or `not_null`.

In [20]:
# frame3["area"].isnull()
frame3["area"].notnull()

a    False
b    False
c    False
d    False
e    False
f    False
Name: area, dtype: bool

### A row in a DataFrame can be retrieved with the special `loc`, `iloc`, `at`, or `iat` attribute
- by index:
        frame3.loc[['c', 'd']]
        frame3.at['c', 'year']
        
- by position:
        frame3.iloc[[2,3]]
        frame3.iat[2,1]


Main differences:
- `loc`: work on index
- `iloc`: work on position
- `at`: Select only one element value by row and column label (index). It's a very fast `loc`
- `iat`: Select only one element value by row and column position (integers). It's a very fast `iloc`

In [21]:
frame3

     state  year   pop area
a  Indiana  2000   6.0  NaN
b  Indiana  2001   6.1  NaN
c  Indiana  2002   6.2  NaN
d     Ohio  2001  11.2  NaN
e     Ohio  2002  11.4  NaN
f     Ohio  2003  11.5  NaN

In [22]:
frame3.loc[["c", "d"]]

     state  year   pop area
c  Indiana  2002   6.2  NaN
d     Ohio  2001  11.2  NaN

In [23]:
frame3.iloc[[2, 3]]

     state  year   pop area
c  Indiana  2002   6.2  NaN
d     Ohio  2001  11.2  NaN

In [24]:
frame3.at["c", "year"]

2002

In [25]:
frame3.iat[2, 1] = 2005

frame3

     state  year   pop area
a  Indiana  2000   6.0  NaN
b  Indiana  2001   6.1  NaN
c  Indiana  2005   6.2  NaN
d     Ohio  2001  11.2  NaN
e     Ohio  2002  11.4  NaN
f     Ohio  2003  11.5  NaN

In [26]:
%timeit  frame3.loc['c', 'year']

5.83 µs ± 116 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [27]:
%timeit  frame3.at['c', 'year']

3.58 µs ± 24.3 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

### Modify column(s) by assignment

Right hand side could be an equal-length list or a NumPy array.

In [28]:
frame3["area"] = np.arange(6.0)

frame3

     state  year   pop  area
a  Indiana  2000   6.0   0.0
b  Indiana  2001   6.1   1.0
c  Indiana  2005   6.2   2.0
d     Ohio  2001  11.2   3.0
e     Ohio  2002  11.4   4.0
f     Ohio  2003  11.5   5.0

### Drop column(s)

- `drop`: Drop specified labels from rows or columns. It returns a copy.
- `del`: Remove columns on the underlying data.

In [29]:
# frame3.drop(columns=["pop", "area"], inplace=True)

frame3.drop(columns=["pop", "area"])

     state  year
a  Indiana  2000
b  Indiana  2001
c  Indiana  2005
d     Ohio  2001
e     Ohio  2002
f     Ohio  2003

In [30]:
# del frame3.loc['b']
del frame3["area"]

frame3

     state  year   pop
a  Indiana  2000   6.0
b  Indiana  2001   6.1
c  Indiana  2005   6.2
d     Ohio  2001  11.2
e     Ohio  2002  11.4
f     Ohio  2003  11.5

`del` will overwrite the `frame3`.

### Boolean filter 

It is possible to filter any column based on the comparison with a reference data, for example, the rows are filtered for values **of the column 'pop' greater than or equal to 6.1.**

In [31]:
frame

     state  year   pop
0  Indiana  2000   6.0
1  Indiana  2001   6.1
2  Indiana  2002   6.2
3     Ohio  2001  11.2
4     Ohio  2002  11.4
5     Ohio  2003  11.5

In [32]:
frame["pop"] >= 6.1

0    False
1     True
2     True
3     True
4     True
5     True
Name: pop, dtype: bool

In [33]:
df_pop = frame[frame["pop"] >= 6.1]

df_pop

     state  year   pop
1  Indiana  2001   6.1
2  Indiana  2002   6.2
3     Ohio  2001  11.2
4     Ohio  2002  11.4
5     Ohio  2003  11.5

Two simultaneous filters can be performed: Rows whose values **of the column 'pop' greater than or equal to 6.1** and **values in column 'year' are greater or equal to 2002.**

In [34]:
df_pop2002 = frame[(frame["pop"] >= 6.1) & (frame["year"] >= 2002)]

df_pop2002

     state  year   pop
2  Indiana  2002   6.2
4     Ohio  2002  11.4
5     Ohio  2003  11.5

**Notice that both filters need to be enclosed in parenthesis!!!**

# Section 2. Data Cleaning

## Import data

You can find the firm A's financial data in the data folder. We will be using this data set in the rest of Chapter 4.

Use the Pandas method `pd.read_csv()` to load the data from the file address.

More pandas IO tools, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html).<br>
*In computing, serialization is the process of translating a data structure or object state into a format that can be stored.*


- [json](https://www.json.org/json-en.html): JavaScript Object Notation. JSON is a syntax for storing and exchanging data.
- [pickle](https://docs.python.org/3/library/pickle.html): a Python’s way to serialize things. It is not secure but quick & easy serializing data, ideally used in parallel computing.
- [parquet](https://parquet.apache.org/): a columnar storage format available to any project in the Apache Hadoop ecosystem.
- [feather](https://arrow.apache.org/docs/python/feather.html): a portable file format for storing Apache Arrow tables or data frames.

**If you are working on a large dataset, say around 1gb~20gb in .csv or .pkl format, consider using .parquet or .feather format.**<br>
There is an interesting [comparison](https://towardsdatascience.com/the-best-format-to-save-pandas-data-414dca023e0d). 

<font color='red'>Warning: pickle is only recommended as a short-term storage format.</font> The problem is that it is hard to guarantee that the format will be stable over time; an object pickled today may not unpickle with a later version of a library. We have tried to maintain backward compatibility when possible, but at some point in the future it may be necessary to “break” the pickle format.

In [35]:
import numpy as np
import pandas as pd

# Load data
f_pd4firm = "data/pd4firm.csv"
df = pd.read_csv(f_pd4firm)

Use the method `head()` to display the first five rows of the dataframe.

In [36]:
# To see what the data set looks like, we'll use the head() method.
df.head()

  name  datadate asset capitalstock depreciation revenue  cost orders
0    A   3/31/00  7007          723          409    1945  1375      2
1    A   6/30/00  6932          721          407    1825  1257      2
2    A   9/30/00  6803          700          387    1870  1385      ?
3    A  12/31/00  5986          NaN          NaN    1007  1004      4
4    A   3/31/01  6130          721          390    1431  1024      5

In [37]:
df

   name  datadate asset capitalstock depreciation revenue  cost orders
0     A   3/31/00  7007          723          409    1945  1375      2
1     A   6/30/00  6932          721          407    1825  1257      2
2     A   9/30/00  6803          700          387    1870  1385      ?
3     A  12/31/00  5986          NaN          NaN    1007  1004      4
4     A   3/31/01  6130          721          390    1431  1024      5
5     A   6/30/01  6071          727          380    1475  1015      6
6     A   6/30/01  6071          727          380    1475  1015      6
7     A   9/30/01  6021          924          360    1450   983      7
8     A  12/31/01  6122          934          361    1375   925      8
9     A  12/31/01  6122          934          361    1375   925      8
10    A   3/31/02  6264          955          NaN    1495  1057      9
11    A   6/30/02  6293          970          NaN    1429  1010      ?
12    A   9/30/02  6298         1057          NaN    1443  1029      9
13    A  12/31/02  6269         1046          441    1472  1035      9
14    A   3/31/03     ?            ?            ?       ?     ?      ?

As we can see, several question marks appeared in the dataframe; those are missing values which may hinder our further analysis. 

<div>So, how do we identify all those missing values and deal with them?</div> 

<b>How to work with missing data?</b>

Steps for working with missing data:

<ol>
    <li>dentify missing data</li>
    <li>deal with missing data</li>
    <li>correct data format</li>
</ol>

<h2 id="identify_handle_missing_values">Identify and handle missing values</h2>

<h3 id="identify_missing_values">Identify missing values</h3>
<h4>Convert "?" to NaN</h4>
In the firm dataset, missing data may come with the question mark "?".
We replace "?" with NaN (Not a Number), which is Python's default missing value marker, for reasons of computational speed and convenience. Here we use the function: 
 <pre>.replace(A, B, inplace = True) </pre>
to replace A by B

In [38]:
import numpy as np

# replace "?" to NaN
df.replace("?", np.nan, inplace=True)
# df = df.replace("?", np.nan)

df.head(5)

  name  datadate asset capitalstock depreciation revenue  cost orders
0    A   3/31/00  7007          723          409    1945  1375      2
1    A   6/30/00  6932          721          407    1825  1257      2
2    A   9/30/00  6803          700          387    1870  1385    NaN
3    A  12/31/00  5986          NaN          NaN    1007  1004      4
4    A   3/31/01  6130          721          390    1431  1024      5

<h4>Evaluating for Missing Data</h4>

The missing values are converted to default. We use the following functions to identify these missing values. There are two methods to detect missing data:

<ol>
    <li><b>.isnull()</b></li>
    <li><b>.notnull()</b></li>
</ol>
The output is a boolean value indicating whether the value that is passed into the argument is in fact missing data.

In [39]:
missing_data = df.isnull()

missing_data.head(5)

    name  datadate  asset  capitalstock  depreciation  revenue   cost  orders
0  False     False  False         False         False    False  False   False
1  False     False  False         False         False    False  False   False
2  False     False  False         False         False    False  False    True
3  False     False  False          True          True    False  False   False
4  False     False  False         False         False    False  False   False

"True" stands for missing value, while "False" stands for not missing value.

<h4>Count missing values in each column</h4>
<p>
Using a for loop in Python, we can quickly figure out the number of missing values in each column. As mentioned above, "True" represents a missing value, "False"  means the value is present in the dataset.  In the body of the for loop the method  ".value_counts()"  counts the number of "True" values. 
</p>

In [40]:
missing_data.columns.values

array(['name', 'datadate', 'asset', 'capitalstock', 'depreciation',
       'revenue', 'cost', 'orders'], dtype=object)

In [41]:
for column in missing_data.columns:
    print(column)
    print(missing_data[column].value_counts())
    print("")

name
False    15
Name: name, dtype: int64

datadate
False    15
Name: datadate, dtype: int64

asset
False    14
True      1
Name: asset, dtype: int64

capitalstock
False    13
True      2
Name: capitalstock, dtype: int64

depreciation
False    10
True      5
Name: depreciation, dtype: int64

revenue
False    14
True      1
Name: revenue, dtype: int64

cost
False    14
True      1
Name: cost, dtype: int64

orders
False    12
True      3
Name: orders, dtype: int64

In [42]:
# save the preprocessed df as df_raw
df_raw = df.copy()

df

   name  datadate asset capitalstock depreciation revenue  cost orders
0     A   3/31/00  7007          723          409    1945  1375      2
1     A   6/30/00  6932          721          407    1825  1257      2
2     A   9/30/00  6803          700          387    1870  1385    NaN
3     A  12/31/00  5986          NaN          NaN    1007  1004      4
4     A   3/31/01  6130          721          390    1431  1024      5
5     A   6/30/01  6071          727          380    1475  1015      6
6     A   6/30/01  6071          727          380    1475  1015      6
7     A   9/30/01  6021          924          360    1450   983      7
8     A  12/31/01  6122          934          361    1375   925      8
9     A  12/31/01  6122          934          361    1375   925      8
10    A   3/31/02  6264          955          NaN    1495  1057      9
11    A   6/30/02  6293          970          NaN    1429  1010    NaN
12    A   9/30/02  6298         1057          NaN    1443  1029      9
13    A  12/31/02  6269         1046          441    1472  1035      9
14    A   3/31/03   NaN          NaN          NaN     NaN   NaN    NaN

<h3 id="deal_missing_values">Deal with missing data</h3>
<b>How to deal with missing data?</b>

<ol>
    <li>drop data<br>
        a. drop the whole row<br>
        b. drop the whole column
    </li>
    <li>replace data<br>
        a. replace it by mean<br>
        b. replace it by interpolating<br>
        c. replace it based on other functions
    </li>
</ol>

Whole columns should be dropped only if most entries in the column are empty. In our dataset, none of the columns are empty enough to drop entirely.
We have some freedom in choosing which method to replace data; however, some methods may seem more reasonable than others. We will apply each method to many different columns:

<b>Drop the whole row:</b>

<ul>
    <li>"index# 12": 6 missing data, simply delete the whole row</li>
</ul>

<b>Replace by mean:</b>

<ul>
    <li>"depreciation": 5 missing data, replace them with mean</li>
</ul>

<b>Interpolate the columns:</b>

<ul>
    <li>"orders": 3 missing data, linear interpolation.</li>
</ul>

In [43]:
# drop all missing entries
df.dropna()  # how="all"

   name  datadate asset capitalstock depreciation revenue  cost orders
0     A   3/31/00  7007          723          409    1945  1375      2
1     A   6/30/00  6932          721          407    1825  1257      2
4     A   3/31/01  6130          721          390    1431  1024      5
5     A   6/30/01  6071          727          380    1475  1015      6
6     A   6/30/01  6071          727          380    1475  1015      6
7     A   9/30/01  6021          924          360    1450   983      7
8     A  12/31/01  6122          934          361    1375   925      8
9     A  12/31/01  6122          934          361    1375   925      8
13    A  12/31/02  6269         1046          441    1472  1035      9

In [44]:
# simply drop whole row with NaN in "revenue" column
df.dropna(subset=["revenue"], axis=0, inplace=True)
# df = df.dropna(subset=["revenue"], axis=0)

df

   name  datadate asset capitalstock depreciation revenue  cost orders
0     A   3/31/00  7007          723          409    1945  1375      2
1     A   6/30/00  6932          721          407    1825  1257      2
2     A   9/30/00  6803          700          387    1870  1385    NaN
3     A  12/31/00  5986          NaN          NaN    1007  1004      4
4     A   3/31/01  6130          721          390    1431  1024      5
5     A   6/30/01  6071          727          380    1475  1015      6
6     A   6/30/01  6071          727          380    1475  1015      6
7     A   9/30/01  6021          924          360    1450   983      7
8     A  12/31/01  6122          934          361    1375   925      8
9     A  12/31/01  6122          934          361    1375   925      8
10    A   3/31/02  6264          955          NaN    1495  1057      9
11    A   6/30/02  6293          970          NaN    1429  1010    NaN
12    A   9/30/02  6298         1057          NaN    1443  1029      9
13    A  12/31/02  6269         1046          441    1472  1035      9

`.fillna`:

- 'ffill': propagate last valid observation forward to next valid 
- 'backfill' or 'bfill': propagate non-null values forward

In [45]:
# Fill NA/NaN values using the non-null values forward "ffill".
df["depreciation"].fillna(method="backfill")

0     409
1     407
2     387
3     390
4     390
5     380
6     380
7     360
8     361
9     361
10    441
11    441
12    441
13    441
Name: depreciation, dtype: object

In [46]:
# We can fill the gaps with its mean value.
df["depreciation"].fillna(np.mean(df["depreciation"].astype("float")))

0       409
1       407
2       387
3     387.6
4       390
5       380
6       380
7       360
8       361
9       361
10    387.6
11    387.6
12    387.6
13      441
Name: depreciation, dtype: object

Why `.astype`? Because of the data type of `df["depreciation"]`. Check it!

In [47]:
type(df.at[0, "depreciation"])

str

`.replace`: a more general way to replace the element in DataFrame.

In [48]:
# Calculate the mean value for the 'depreciation' column
avg_depreciation = df["depreciation"].astype("float").mean()
print("Average depreciation:", avg_depreciation)

# Replace "NaN" by mean value
df["depreciation"].replace(np.nan, avg_depreciation, inplace=True)
# df["depreciation"] =df["depreciation"].replace(np.nan, avg_depreciation)

df

Average depreciation: 387.6

   name  datadate asset capitalstock depreciation revenue  cost orders
0     A   3/31/00  7007          723          409    1945  1375      2
1     A   6/30/00  6932          721          407    1825  1257      2
2     A   9/30/00  6803          700          387    1870  1385    NaN
3     A  12/31/00  5986          NaN        387.6    1007  1004      4
4     A   3/31/01  6130          721          390    1431  1024      5
5     A   6/30/01  6071          727          380    1475  1015      6
6     A   6/30/01  6071          727          380    1475  1015      6
7     A   9/30/01  6021          924          360    1450   983      7
8     A  12/31/01  6122          934          361    1375   925      8
9     A  12/31/01  6122          934          361    1375   925      8
10    A   3/31/02  6264          955        387.6    1495  1057      9
11    A   6/30/02  6293          970        387.6    1429  1010    NaN
12    A   9/30/02  6298         1057        387.6    1443  1029      9
13    A  12/31/02  6269         1046          441    1472  1035      9

In [49]:
# Linear interpolate orders
# df["orders"].astype("float").interpolate(method="linear", inplace=True) # doesn't work
df["orders"] = df["orders"].astype("float").interpolate(method="linear")

df

   name  datadate asset capitalstock depreciation revenue  cost  orders
0     A   3/31/00  7007          723          409    1945  1375     2.0
1     A   6/30/00  6932          721          407    1825  1257     2.0
2     A   9/30/00  6803          700          387    1870  1385     3.0
3     A  12/31/00  5986          NaN        387.6    1007  1004     4.0
4     A   3/31/01  6130          721          390    1431  1024     5.0
5     A   6/30/01  6071          727          380    1475  1015     6.0
6     A   6/30/01  6071          727          380    1475  1015     6.0
7     A   9/30/01  6021          924          360    1450   983     7.0
8     A  12/31/01  6122          934          361    1375   925     8.0
9     A  12/31/01  6122          934          361    1375   925     8.0
10    A   3/31/02  6264          955        387.6    1495  1057     9.0
11    A   6/30/02  6293          970        387.6    1429  1010     9.0
12    A   9/30/02  6298         1057        387.6    1443  1029     9.0
13    A  12/31/02  6269         1046          441    1472  1035     9.0

### Removing Duplicates

In [50]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9      True
10    False
11    False
12    False
13    False
dtype: bool

In [51]:
df = df.drop_duplicates()

In [52]:
df = df.reset_index(drop=True)

df

   name  datadate asset capitalstock depreciation revenue  cost  orders
0     A   3/31/00  7007          723          409    1945  1375     2.0
1     A   6/30/00  6932          721          407    1825  1257     2.0
2     A   9/30/00  6803          700          387    1870  1385     3.0
3     A  12/31/00  5986          NaN        387.6    1007  1004     4.0
4     A   3/31/01  6130          721          390    1431  1024     5.0
5     A   6/30/01  6071          727          380    1475  1015     6.0
6     A   9/30/01  6021          924          360    1450   983     7.0
7     A  12/31/01  6122          934          361    1375   925     8.0
8     A   3/31/02  6264          955        387.6    1495  1057     9.0
9     A   6/30/02  6293          970        387.6    1429  1010     9.0
10    A   9/30/02  6298         1057        387.6    1443  1029     9.0
11    A  12/31/02  6269         1046          441    1472  1035     9.0

<h3 id="correct_data_format">Correct data format</h3>


<p>One of the last step is checking and making sure that all data is in the correct format (int, float, text or other).</p>

In Pandas, we use 

<p><b>.dtype()</b> to check the data type</p>
<p><b>.astype()</b> to change the data type</p>

In [53]:
df.dtypes

name             object
datadate         object
asset            object
capitalstock     object
depreciation     object
revenue          object
cost             object
orders          float64
dtype: object

In [54]:
df

   name  datadate asset capitalstock depreciation revenue  cost  orders
0     A   3/31/00  7007          723          409    1945  1375     2.0
1     A   6/30/00  6932          721          407    1825  1257     2.0
2     A   9/30/00  6803          700          387    1870  1385     3.0
3     A  12/31/00  5986          NaN        387.6    1007  1004     4.0
4     A   3/31/01  6130          721          390    1431  1024     5.0
5     A   6/30/01  6071          727          380    1475  1015     6.0
6     A   9/30/01  6021          924          360    1450   983     7.0
7     A  12/31/01  6122          934          361    1375   925     8.0
8     A   3/31/02  6264          955        387.6    1495  1057     9.0
9     A   6/30/02  6293          970        387.6    1429  1010     9.0
10    A   9/30/02  6298         1057        387.6    1443  1029     9.0
11    A  12/31/02  6269         1046          441    1472  1035     9.0

In [55]:
type(df.at[2, "depreciation"])

str

In [56]:
type(df.at[3, "depreciation"])

float

As we can see above, some columns are not of the correct data type. Numerical variables should have type 'float' or 'int', and variables with strings such as name should have type 'object'. For example, 'asset' and 'orders' variables are numerical values, so we should expect them to be of the type 'float' and 'int'; however, they are shown as type 'object' and 'float64'. We have to convert data types into a proper format for each column using the "astype()" method.

#### Convert data types to proper format

In [57]:
df[["asset", "capitalstock"]] = df[["asset", "capitalstock"]].astype("float")
df[["orders"]] = df[["orders"]].astype("int")

In [58]:
df.astype({"asset": "int", "depreciation": "int"})

   name  datadate  asset  capitalstock  depreciation revenue  cost  orders
0     A   3/31/00   7007         723.0           409    1945  1375       2
1     A   6/30/00   6932         721.0           407    1825  1257       2
2     A   9/30/00   6803         700.0           387    1870  1385       3
3     A  12/31/00   5986           NaN           387    1007  1004       4
4     A   3/31/01   6130         721.0           390    1431  1024       5
5     A   6/30/01   6071         727.0           380    1475  1015       6
6     A   9/30/01   6021         924.0           360    1450   983       7
7     A  12/31/01   6122         934.0           361    1375   925       8
8     A   3/31/02   6264         955.0           387    1495  1057       9
9     A   6/30/02   6293         970.0           387    1429  1010       9
10    A   9/30/02   6298        1057.0           387    1443  1029       9
11    A  12/31/02   6269        1046.0           441    1472  1035       9

In [59]:
df.dtypes

df

   name  datadate   asset  capitalstock depreciation revenue  cost  orders
0     A   3/31/00  7007.0         723.0          409    1945  1375       2
1     A   6/30/00  6932.0         721.0          407    1825  1257       2
2     A   9/30/00  6803.0         700.0          387    1870  1385       3
3     A  12/31/00  5986.0           NaN        387.6    1007  1004       4
4     A   3/31/01  6130.0         721.0          390    1431  1024       5
5     A   6/30/01  6071.0         727.0          380    1475  1015       6
6     A   9/30/01  6021.0         924.0          360    1450   983       7
7     A  12/31/01  6122.0         934.0          361    1375   925       8
8     A   3/31/02  6264.0         955.0        387.6    1495  1057       9
9     A   6/30/02  6293.0         970.0        387.6    1429  1010       9
10    A   9/30/02  6298.0        1057.0        387.6    1443  1029       9
11    A  12/31/02  6269.0        1046.0          441    1472  1035       9

### Transforming Data Using a Function or Mapping

To create a new column based on one existing column (a `pd.Series`), we can use a [`.map`](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html) function.

For example, we want to add a new column indicating if the number of orders is high/low. Let's write down a mapping of each distict order number to the kind of type:

In [60]:
norders_to_highlow = {
    1: "low",
    2: "low",
    3: "low",
    4: "low",
    5: "low",
    6: "high",
    7: "high",
    8: "high",
    9: "high",
    10: "high",
}

In [61]:
# map accepts a dict-like object
df["highorlow"] = df["orders"].map(norders_to_highlow)

df

,name,datadate,asset,capitalstock,depreciation,revenue,cost,orders,highorlow
0,A,3/31/00,7007.0,723.0,409,1945,1375,2,low
1,A,6/30/00,6932.0,721.0,407,1825,1257,2,low
2,A,9/30/00,6803.0,700.0,387,1870,1385,3,low
3,A,12/31/00,5986.0,NaN,387.6,1007,1004,4,low
4,A,3/31/01,6130.0,721.0,390,1431,1024,5,low
5,A,6/30/01,6071.0,727.0,380,1475,1015,6,high
6,A,9/30/01,6021.0,924.0,360,1450,983,7,high
7,A,12/31/01,6122.0,934.0,361,1375,925,8,high
8,A,3/31/02,6264.0,955.0,387.6,1495,1057,9,high
9,A,6/30/02,6293.0,970.0,387.6,1429,1010,9,high
10,A,9/30/02,6298.0,1057.0,387.6,1443,1029,9,high
11,A,12/31/02,6269.0,1046.0,441,1472,1035,9,high

In [62]:
# map accepts a function
df["orders"].map(lambda x: norders_to_highlow[x])

0      low
1      low
2      low
3      low
4      low
5     high
6     high
7     high
8     high
9     high
10    high
11    high
Name: orders, dtype: object

[`.transform`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.transform.html) can call a function on self producing a DataFrame with transformed values.

In [63]:
list(df.columns)

['name',
 'datadate',
 'asset',
 'capitalstock',
 'depreciation',
 'revenue',
 'cost',
 'orders',
 'highorlow']

In [64]:
df.dtypes

name             object
datadate         object
asset           float64
capitalstock    float64
depreciation     object
revenue          object
cost             object
orders            int64
highorlow        object
dtype: object

In [65]:
df[["asset", "orders"]].transform(lambda x: x + 1)

     asset  orders
0   7008.0       3
1   6933.0       3
2   6804.0       4
3   5987.0       5
4   6131.0       6
5   6072.0       7
6   6022.0       8
7   6123.0       9
8   6265.0      10
9   6294.0      10
10  6299.0      10
11  6270.0      10

In [66]:
# .transform takes one function that is expected to be applied to a column and return a column of equal size.
df["orders"].transform(lambda x: norders_to_highlow[x])

0      low
1      low
2      low
3      low
4      low
5     high
6     high
7     high
8     high
9     high
10    high
11    high
Name: orders, dtype: object

In [67]:
df["orders"].apply(lambda x: norders_to_highlow[x])

0      low
1      low
2      low
3      low
4      low
5     high
6     high
7     high
8     high
9     high
10    high
11    high
Name: orders, dtype: object

#### Exercise

- Change the other numerical data (columns `depreciation` - `cost`) type to float
- Interpolate the `capitalstock` column

In [68]:
# insert your code here
# df[["depreciation", "revenue", "cost"]] = None

# df["capitalstock"] = None

# df

<details><summary>Click here for the solution</summary>

```python
df[["depreciation", "revenue", "cost"]] = df[
    ["depreciation", "revenue", "cost"]
].astype("float")

df["capitalstock"] = df["capitalstock"].interpolate(method="linear")

df
```

</details>